#+TITLE: Vaeep's GNU Emacs Configuration
#+AUTHOR: Diogo Gonçalves (Vaeep)
#+DESCRIPTION: Vaeep's personal Emacs configuration.
#+STARTUP: showeverything
#+OPTION: toc:2

** Display Relative Line Numbers
#+BEGIN_SRC emacs-lisp
  (defun display-line-numbers-hook ()
    (display-line-numbers-mode 1)
    (setq display-line-numbers 'relative
      display-line-numbers-current-absolute t))

  (add-hook 'prog-mode-hook 'display-line-numbers-hook)
  (add-hook 'org-mode-hook 'display-line-numbers-hook)
  (add-hook 'text-mode-hook 'display-line-numbers-hook)
#+END_SRC

#+RESULTS:
| display-line-numbers-hook | text-mode-hook-identify |

** Setting Font Faces
#+BEGIN_SRC emacs-lisp
  (set-face-attribute 'default nil
                      :font "Iosevka NFM"
                      :height 180
                      :weight 'medium)
  ;; Variable-pitch is used in the web browser
  (set-face-attribute 'variable-pitch nil
                      :font "Iosevka NFM"
                      :height 180
                      :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
                      :font "Iosevka NFM"
                      :height 180
                      :weight 'medium)
  (setq-default line-spacing 0.0)
#+END_SRC

#+RESULTS:
: 0.0
** Dired Preview
#+BEGIN_SRC emacs-lisp
  (use-package dired-preview
    :ensure t)

  ;; Default values for demo purposes
  (setq dired-preview-delay 0.0)
  (setq dired-preview-max-size (expt 2 20))
  (setq dired-preview-ignored-extensions-regexp
        (concat "\\."
                "\\(mkv\\|webm\\|mp4\\|mp3\\|ogg\\|m4a"
                "\\|gz\\|zst\\|tar\\|xz\\|rar\\|zip"
                "\\|iso\\|epub\\|pdf\\)"))

  (defun my-dired-preview-to-the-right ()
    "My preferred `dired-preview-display-action-alist-function'."
    '((display-buffer-in-side-window)
      (side . right)
      (width . 0.5)))

  (setq dired-preview-display-action-alist-function #'my-dired-preview-to-the-right)

  (add-hook 'dired-mode-hook 'dired-preview-mode 1)
#+END_SRC

#+RESULTS:
| all-the-icons-dired-mode | dired-preview-mode |
** Enabling Org Bullets
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook (lambda () (org-indent-mode 1)))
  (use-package org-bullets :ensure t)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))) 
#+end_src

#+RESULTS:
| toc-org-enable | rainbow-mode | (lambda nil (visual-line-mode 1)) | (lambda nil (org-bullets-mode 1)) | (lambda nil (org-indent-mode 1)) | display-line-numbers-hook | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |
** Ensures Visual Line Mode in Org
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook (lambda () (visual-line-mode 1)))
#+END_SRC

#+RESULTS:
| (lambda nil (visual-line-mode 1)) | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | toc-org-enable | rainbow-mode | (lambda nil (org-bullets-mode 1)) | (lambda nil (org-indent-mode 1)) | display-line-numbers-hook | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Org-agenda
#+begin_src emacs-lisp
  ;; Need to add all subdirectories from ~/notes/ in order to work properly with org-agenda
  (setq org-agenda-files '("~/notes/"
                           "~/notes/f2024/"))
  (setq org-agenda-span 14)
#+end_src

#+RESULTS:
: 14
** Set Default File Apps
#+begin_src emacs-lisp
  (add-to-list 'org-file-apps '("\\.pdf" . "zathura %s"))
#+end_src

#+RESULTS:
: ((.pdf' . zathura %s) (\.pdf . zathura %s) (auto-mode . emacs) (directory . emacs) (\.mm\' . default) (\.x?html?\' . default) (\.pdf\' . default))
** C/C++
#+BEGIN_SRC emacs-lisp
  ;; Formatter config
  (add-hook 'c-mode-hook
            (lambda ()
              (setq format-all-formatters
                    '(("C" (clang-format "--style=Google -i"))))))

  (add-hook 'c++-mode-hook
            (lambda ()
              (setq format-all-formatters
                    '(("C++" (clang-format "--style=Google -i"))))))


#+END_SRC

#+RESULTS:
| lambda | nil | (setq format-all-formatters '((C (clang-format --style=Google)))) |
** Setting Vterm
#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :ensure t
    :config
    (setq shell-file-name "/bin/sh"
          vterm-max-scrollback 5000))

  (use-package multi-vterm :ensure t)
  ;; dedicated terminal height of 30%
  (setq multi-vterm-dedicated-window-height-percent 30)
#+END_SRC

#+RESULTS:
: 30

Also setting vterm-toggle so I can open easily to execute minor tasks inside of it without leaving the current buffer.
#+BEGIN_SRC emacs-lisp
  (use-package vterm-toggle
    :ensure t  
    :after vterm
    :config
    (setq vterm-toggle-fullscreen-p nil)
    (add-to-list 'display-buffer-alist
             '((lambda (buffer-or-name _)
                   (let ((buffer (get-buffer buffer-or-name)))
                     (with-current-buffer buffer
                       (or (equal major-mode 'vterm-mode)
                           (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
                (display-buffer-reuse-window display-buffer-at-bottom)
                ;;(display-buffer-reuse-window display-buffer-in-direction)
                ;;display-buffer-in-direction/direction/dedicated is added in emacs27
                ;;(direction . bottom)
                ;;(dedicated . t) ;dedicated is supported in emacs27
                (reusable-frames . visible)
                (window-height . 0.5))))
  (global-set-key (kbd "C-x C-t") 'vterm-toggle)
#+END_SRC

#+RESULTS:
: vterm-toggle
** PDF Tools
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools :ensure t)
  (add-hook 'pdf-view-mode-hook 'pdf-view-themed-minor-mode)
#+END_SRC

#+RESULTS:
| pdf-view-themed-minor-mode |
